In [1]:
import numpy as np 
import pandas as pd

In [2]:
BASE_PATH = r"D:\DATA_ANALYST\FULL_STACK_FROJECT\Stock Market Prediction\stock_market_unclean_dataset"
df = pd.read_csv(BASE_PATH + r"\raw_data\nse_prices.csv")

In [3]:
df.head()

         date market company     open     high      low    close
0  2015-01-01    NSE    HDFC  1644.37  1646.79  1617.40  1641.66
1  2015-01-02    NSE    HDFC  1655.07  1693.92  1645.13  1685.08
2  2015-01-05    NSE    HDFC  1681.00  1704.29  1671.15  1676.26
3  2015-01-06    NSE    HDFC  1708.71  1728.73  1688.23  1724.15
4  2015-01-07    NSE    HDFC  1715.10  1729.04  1687.92  1726.33

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144600 entries, 0 to 144599
Data columns (total 7 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   date     144600 non-null  object
 1   market   144600 non-null  object
 2   company  144600 non-null  object
 3   open     144600 non-null  float64
 4   high     144600 non-null  float64
 5   low      144600 non-null  float64
 6   close    144600 non-null  float64
dtypes: float64(4), object(3)
memory usage: 7.7+ MB

In [5]:
df['date'] = pd.to_datetime(df['date'], errors='coerce')
df.dropna(subset=['date'], inplace=True)
df.sort_values(by=['company', 'date'], inplace=True)

In [6]:
df['company'] = df['company'].str.strip().str.upper()

In [7]:
df['close'] = df.groupby('company')['close'].ffill()
df['close'] = df.groupby('company')['close'].bfill()

In [8]:
df = df[(df['high'] >= df['low']) &
        (df['high'] >= df['open']) &
        (df['high'] >= df['close']) &
        (df['low']  <= df['open']) &
        (df['low']  <= df['close'])]

In [9]:
price_cols = ['open', 'high', 'low', 'close']
df = df[(df[price_cols] > 0).all(axis=1)]

In [10]:
df.drop_duplicates(subset=['date', 'company'], inplace=True)

In [11]:
df = df[(df['open'] < df['open'].quantile(0.999)) &
        (df['close'] < df['close'].quantile(0.999))]

In [12]:
df.reset_index(drop=True, inplace=True)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144443 entries, 0 to 144442
Data columns (total 7 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   date     144443 non-null  datetime64[ns]
 1   market   144443 non-null  object
 2   company  144443 non-null  object
 3   open     144443 non-null  float64
 4   high     144443 non-null  float64
 5   low      144443 non-null  float64
 6   close    144443 non-null  float64
dtypes: datetime64[ns](1), float64(4), object(2)
memory usage: 7.7+ MB

In [14]:
df.head()

        date market     company     open     high      low    close
0 2015-01-01    NSE  ADANIPOWER  1206.01  1220.81  1171.63  1190.41
1 2015-01-02    NSE  ADANIPOWER  1213.11  1230.17  1208.55  1209.77
2 2015-01-05    NSE  ADANIPOWER  1241.20  1260.47  1200.64  1218.40
3 2015-01-06    NSE  ADANIPOWER  1207.99  1214.94  1155.90  1177.41
4 2015-01-07    NSE  ADANIPOWER  1192.87  1208.36  1172.50  1201.68

In [15]:
df = df.rename(columns={'date': 'trade_date'})
df = df[['trade_date', 'company', 'open', 'high', 'low', 'close']]

In [16]:
df.head()

  trade_date     company     open     high      low    close
0 2015-01-01  ADANIPOWER  1206.01  1220.81  1171.63  1190.41
1 2015-01-02  ADANIPOWER  1213.11  1230.17  1208.55  1209.77
2 2015-01-05  ADANIPOWER  1241.20  1260.47  1200.64  1218.40
3 2015-01-06  ADANIPOWER  1207.99  1214.94  1155.90  1177.41
4 2015-01-07  ADANIPOWER  1192.87  1208.36  1172.50  1201.68

In [17]:
df.to_csv("nse_prices.csv", index=False)

In [18]:
df.shape

(144443, 6)